{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "restaurant_reviews",
    "1": "nutrition_info",
    "2": "account_blocked",
    "3": "oil_change_how",
    "4": "time",
    "5": "weather",
    "6": "redeem_rewards",
    "7": "interest_rate",
    "8": "gas_type",
    "9": "accept_reservations",
    "10": "smart_home",
    "11": "user_name",
    "12": "report_lost_card",
    "13": "repeat",
    "14": "whisper_mode",
    "15": "what_are_your_hobbies",
    "16": "order",
    "17": "jump_start",
    "18": "schedule_meeting",
    "19": "meeting_schedule",
    "20": "freeze_account",
    "21": "what_song",
    "22": "meaning_of_life",
    "23": "restaurant_reservation",
    "24": "traffic",
    "25": "make_call",
    "26": "text",
    "27": "bill_balance",
    "28": "improve_credit_score",
    "29": "change_language",
    "30": "no",
    "31": "measurement_conversion",
    "32": "timer",
    "33": "flip_coin",
    "34": "do_you_have_pets",
    "35": "balance",
    "36": "tell_joke",
    "37": "last_maintenance",
    "38": "exchange_rate",
    "39": "uber",
    "40": "car_rental",
    "41": "credit_limit",
    "42": "oos",
    "43": "shopping_list",
    "44": "expiration_date",
    "45": "routing",
    "46": "meal_suggestion",
    "47": "tire_change",
    "48": "todo_list",
    "49": "card_declined",
    "50": "rewards_balance",
    "51": "change_accent",
    "52": "vaccines",
    "53": "reminder_update",
    "54": "food_last",
    "55": "change_ai_name",
    "56": "bill_due",
    "57": "who_do_you_work_for",
    "58": "share_location",
    "59": "international_visa",
    "60": "calendar",
    "61": "translate",
    "62": "carry_on",
    "63": "book_flight",
    "64": "insurance_change",
    "65": "todo_list_update",
    "66": "timezone",
    "67": "cancel_reservation",
    "68": "transactions",
    "69": "credit_score",
    "70": "report_fraud",
    "71": "spending_history",
    "72": "directions",
    "73": "spelling",
    "74": "insurance",
    "75": "what_is_your_name",
    "76": "reminder",
    "77": "where_are_you_from",
    "78": "distance",
    "79": "payday",
    "80": "flight_status",
    "81": "find_phone",
    "82": "greeting",
    "83": "alarm",
    "84": "order_status",
    "85": "confirm_reservation",
    "86": "cook_time",
    "87": "damaged_card",
    "88": "reset_settings",
    "89": "pin_change",
    "90": "replacement_card_duration",
    "91": "new_card",
    "92": "roll_dice",
    "93": "income",
    "94": "taxes",
    "95": "date",
    "96": "who_made_you",
    "97": "pto_request",
    "98": "tire_pressure",
    "99": "how_old_are_you",
    "100": "rollover_401k",
    "101": "pto_request_status",
    "102": "how_busy",
    "103": "application_status",
    "104": "recipe",
    "105": "calendar_update",
    "106": "play_music",
    "107": "yes",
    "108": "direct_deposit",
    "109": "credit_limit_change",
    "110": "gas",
    "111": "pay_bill",
    "112": "ingredients_list",
    "113": "lost_luggage",
    "114": "goodbye",
    "115": "what_can_i_ask_you",
    "116": "book_hotel",
    "117": "are_you_a_bot",
    "118": "next_song",
    "119": "change_speed",
    "120": "plug_type",
    "121": "maybe",
    "122": "w2",
    "123": "oil_change_when",
    "124": "thank_you",
    "125": "shopping_list_update",
    "126": "pto_balance",
    "127": "order_checks",
    "128": "travel_alert",
    "129": "fun_fact",
    "130": "sync_device",
    "131": "schedule_maintenance",
    "132": "apr",
    "133": "transfer",
    "134": "ingredient_substitution",
    "135": "calories",
    "136": "current_location",
    "137": "international_fees",
    "138": "calculator",
    "139": "definition",
    "140": "next_holiday",
    "141": "update_playlist",
    "142": "mpg",
    "143": "min_payment",
    "144": "change_user_name",
    "145": "restaurant_suggestion",
    "146": "travel_notification",
    "147": "cancel",
    "148": "pto_used",
    "149": "travel_suggestion",
    "150": "change_volume"
  },
  "initializer_range": 0.02,
  "label2id": {
    "accept_reservations": 9,
    "account_blocked": 2,
    "alarm": 83,
    "application_status": 103,
    "apr": 132,
    "are_you_a_bot": 117,
    "balance": 35,
    "bill_balance": 27,
    "bill_due": 56,
    "book_flight": 63,
    "book_hotel": 116,
    "calculator": 138,
    "calendar": 60,
    "calendar_update": 105,
    "calories": 135,
    "cancel": 147,
    "cancel_reservation": 67,
    "car_rental": 40,
    "card_declined": 49,
    "carry_on": 62,
    "change_accent": 51,
    "change_ai_name": 55,
    "change_language": 29,
    "change_speed": 119,
    "change_user_name": 144,
    "change_volume": 150,
    "confirm_reservation": 85,
    "cook_time": 86,
    "credit_limit": 41,
    "credit_limit_change": 109,
    "credit_score": 69,
    "current_location": 136,
    "damaged_card": 87,
    "date": 95,
    "definition": 139,
    "direct_deposit": 108,
    "directions": 72,
    "distance": 78,
    "do_you_have_pets": 34,
    "exchange_rate": 38,
    "expiration_date": 44,
    "find_phone": 81,
    "flight_status": 80,
    "flip_coin": 33,
    "food_last": 54,
    "freeze_account": 20,
    "fun_fact": 129,
    "gas": 110,
    "gas_type": 8,
    "goodbye": 114,
    "greeting": 82,
    "how_busy": 102,
    "how_old_are_you": 99,
    "improve_credit_score": 28,
    "income": 93,
    "ingredient_substitution": 134,
    "ingredients_list": 112,
    "insurance": 74,
    "insurance_change": 64,
    "interest_rate": 7,
    "international_fees": 137,
    "international_visa": 59,
    "jump_start": 17,
    "last_maintenance": 37,
    "lost_luggage": 113,
    "make_call": 25,
    "maybe": 121,
    "meal_suggestion": 46,
    "meaning_of_life": 22,
    "measurement_conversion": 31,
    "meeting_schedule": 19,
    "min_payment": 143,
    "mpg": 142,
    "new_card": 91,
    "next_holiday": 140,
    "next_song": 118,
    "no": 30,
    "nutrition_info": 1,
    "oil_change_how": 3,
    "oil_change_when": 123,
    "oos": 42,
    "order": 16,
    "order_checks": 127,
    "order_status": 84,
    "pay_bill": 111,
    "payday": 79,
    "pin_change": 89,
    "play_music": 106,
    "plug_type": 120,
    "pto_balance": 126,
    "pto_request": 97,
    "pto_request_status": 101,
    "pto_used": 148,
    "recipe": 104,
    "redeem_rewards": 6,
    "reminder": 76,
    "reminder_update": 53,
    "repeat": 13,
    "replacement_card_duration": 90,
    "report_fraud": 70,
    "report_lost_card": 12,
    "reset_settings": 88,
    "restaurant_reservation": 23,
    "restaurant_reviews": 0,
    "restaurant_suggestion": 145,
    "rewards_balance": 50,
    "roll_dice": 92,
    "rollover_401k": 100,
    "routing": 45,
    "schedule_maintenance": 131,
    "schedule_meeting": 18,
    "share_location": 58,
    "shopping_list": 43,
    "shopping_list_update": 125,
    "smart_home": 10,
    "spelling": 73,
    "spending_history": 71,
    "sync_device": 130,
    "taxes": 94,
    "tell_joke": 36,
    "text": 26,
    "thank_you": 124,
    "time": 4,
    "timer": 32,
    "timezone": 66,
    "tire_change": 47,
    "tire_pressure": 98,
    "todo_list": 48,
    "todo_list_update": 65,
    "traffic": 24,
    "transactions": 68,
    "transfer": 133,
    "translate": 61,
    "travel_alert": 128,
    "travel_notification": 146,
    "travel_suggestion": 149,
    "uber": 39,
    "update_playlist": 141,
    "user_name": 11,
    "vaccines": 52,
    "w2": 122,
    "weather": 5,
    "what_are_your_hobbies": 15,
    "what_can_i_ask_you": 115,
    "what_is_your_name": 75,
    "what_song": 21,
    "where_are_you_from": 77,
    "whisper_mode": 14,
    "who_do_you_work_for": 57,
    "who_made_you": 96,
    "yes": 107
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.9.2",
  "vocab_size": 30522
}